{
	"title": "Thaumcraft 4 Research Helper",
	"version": "Version: ",
	"from": "From: ",
	"to": "To: ",
	"min_steps": "Min. Steps: ",
	"addons": "Addons: ",
	"available_spects": "Available Aspects: ",
	"find_connection": "Find Connection",
	"close_results": "Close all results",
	"sel_all": "Select All Aspects",
	"desel_all": "Deselect All Aspects",
	"aspects_used": "Aspects Used",
	"total_steps": "Total Steps: ",
	"help": "Help",
	"help_p1": [
		"This script helps you with your Thaumcraft 4.1 research. ",
		"If you have a research note with two aspects that you don't know how to connect, ",
		"simply choose them in the dropdown list above (<strong>From:</strong> and <strong>To:</strong>). ",
		"Additionally, choose the minimum number of steps between those two aspects. ",
		"If in your research note, the two aspects have two blank spaces between them, choose the value 2 for <strong>Min. Steps</strong>. ",
		"Then click <strong>Find Connection</strong> and the script will search for the shortest path (well, with at least the minimum length) that connects the two aspects. ",
		"Note that sometimes the length of any path is longer then the given minimum, but this should not be a problem for your research note."
	],
	"help_p2": [
		"If you are unhappy with the path you got, because you do not have access to those aspects yet or they are quite rare, ",
		"simply disable those aspects from <strong>Available Aspects:</strong>. ",
		"The script will then try to find paths without these. Note that this may cause the path to grow longer. ",
		"If too many aspects are disabled and there are no paths left without any of those, the script will try to find the shortest path using the minimal number of disabled aspects."
	],
	"author": [
		"The original author of this script is <a href=\"https://github.com/ythri\" style=\"color:#55a;\" target=\"_blank\">ythri</a>. ",
		"This multi-language version is maintained by <a href=\"https://github.com/jyhsu2000\" style=\"color:#55a;\" target=\"_blank\">jyhsu2000</a>.<br />",
		"If you have any questions or suggestions of this version, or you want to provide other language pack. ",
		"Please use <a href=\"https://github.com/jyhsu2000/tcresearch/issues\" style=\"color:#55a;\" target=\"_blank\">Issues</a> on GitHub"
	],
	"copyright": [
		"This work is licensed under a <a href=\"http://creativecommons.org/licenses/by/4.0/\" style=\"color:#55a;\" target=\"_blank\">Creative Commons Attribution 4.0 License</a>. ",
		"Sources of original version can be found in the <a href=\"https://github.com/ythri/tcresearch/tree/gh-pages\" style=\"color:#55a;\" target=\"_blank\">github repository</a>. ",
		"Sources of multi-language version can be found in the  <a href=\"https://github.com/jyhsu2000/tcresearch/tree/gh-pages\" style=\"color:#55a;\" target=\"_blank\">github repository</a>. "
	]
}